#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/loktf/terraform/runs/run-HqCAkHojmFAsvceu

Waiting for the plan to start...

Terraform v0.14.8
Configuring remote state backend...
Initializing Terraform configuration...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007]
random_id.randomId: Refreshing state... [id=Vg5CMoDBZRE]
azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/networkSecurityGroups/TFC_NSG]
azurerm_public_ip.pip: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/publicIPAddresses/myPublicIP]
azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/virtualNetworks/Vnet-tf]
azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/virtualNetworks/Vnet-tf/subnets/Subnet01]
azurerm_network_interface.nic: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/networkInterfaces/myNIC]
azurerm_network_interface_security_group_association.ngsa: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/networkInterfaces/myNIC|/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/networkSecurityGroups/TFC_NSG]
azurerm_linux_virtual_machine.myterraformvm: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Compute/virtualMachines/TFCloud]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.myterraformvm must be replaced
-/+ resource "azurerm_linux_virtual_machine" "myterraformvm" {
      # Warning: this attribute value will be marked as sensitive and will
      # not display in UI output after applying this change
      ~ admin_password                  = (sensitive value)
      ~ admin_username                  = "azureuser" -> "adminuser" # forces replacement
      - encryption_at_host_enabled      = false -> null
      ~ id                              = "/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Compute/virtualMachines/TFCloud" -> (known after apply)
      ~ name                            = "TFCloud" -> "TFCloudVM" # forces replacement
      ~ network_interface_ids           = [
          - "/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/networkInterfaces/myNIC",
        ] -> (known after apply)
      ~ private_ip_address              = "10.0.1.4" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.0.1.4",
        ] -> (known after apply)
      ~ public_ip_address               = "137.117.214.71" -> (known after apply)
      ~ public_ip_addresses             = [
          - "137.117.214.71",
        ] -> (known after apply)
      ~ resource_group_name             = "TFCloudRG007" -> "TFCloudRG" # forces replacement
        tags                            = {
            "environment" = "Terraform Cloud Demo"
        }
      ~ virtual_machine_id              = "bf080aec-012c-4b0d-b1cf-bb544f842dd0" -> (known after apply)
      + zone                            = (known after apply)
        # (10 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
            name                      = "myOsDisk"
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_network_interface.nic must be replaced
-/+ resource "azurerm_network_interface" "nic" {
      ~ applied_dns_servers           = [] -> (known after apply)
      ~ dns_servers                   = [] -> (known after apply)
      ~ id                            = "/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/networkInterfaces/myNIC" -> (known after apply)
      + internal_dns_name_label       = (known after apply)
      ~ internal_domain_name_suffix   = "coui1iuryyqeddbwqolj54zmbf.ax.internal.cloudapp.net" -> (known after apply)
      ~ mac_address                   = "00-0D-3A-AB-43-CA" -> (known after apply)
        name                          = "myNIC"
      ~ private_ip_address            = "10.0.1.4" -> (known after apply)
      ~ private_ip_addresses          = [
          - "10.0.1.4",
        ] -> (known after apply)
      ~ resource_group_name           = "TFCloudRG007" -> "TFCloudRG" # forces replacement
        tags                          = {
            "environment" = "Terraform Cloud Demo"
        }
      ~ virtual_machine_id            = "/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Compute/virtualMachines/TFCloud" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ ip_configuration {
            name                          = "myNicConfiguration"
          ~ primary                       = true -> (known after apply)
          ~ private_ip_address            = "10.0.1.4" -> (known after apply)
          ~ private_ip_address_allocation = "Dynamic" -> "dynamic"
          ~ public_ip_address_id          = "/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/publicIPAddresses/myPublicIP" -> (known after apply)
          ~ subnet_id                     = "/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/virtualNetworks/Vnet-tf/subnets/Subnet01" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # azurerm_network_interface_security_group_association.ngsa must be replaced
-/+ resource "azurerm_network_interface_security_group_association" "ngsa" {
      ~ id                        = "/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/networkInterfaces/myNIC|/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/networkSecurityGroups/TFC_NSG" -> (known after apply)
      ~ network_interface_id      = "/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/networkInterfaces/myNIC" -> (known after apply) # forces replacement
      ~ network_security_group_id = "/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/networkSecurityGroups/TFC_NSG" -> (known after apply) # forces replacement
    }

  # azurerm_network_security_group.nsg must be replaced
-/+ resource "azurerm_network_security_group" "nsg" {
      ~ id                  = "/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/networkSecurityGroups/TFC_NSG" -> (known after apply)
        name                = "TFC_NSG"
      ~ resource_group_name = "TFCloudRG007" -> "TFCloudRG" # forces replacement
        tags                = {
            "environment" = "Terraform Cloud Demo"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_public_ip.pip must be replaced
-/+ resource "azurerm_public_ip" "pip" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/publicIPAddresses/myPublicIP" -> (known after apply)
      ~ ip_address              = "137.117.214.71" -> (known after apply)
        name                    = "myPublicIP"
      ~ resource_group_name     = "TFCloudRG007" -> "TFCloudRG" # forces replacement
        tags                    = {
            "environment" = "Terraform Cloud Demo"
        }
      - zones                   = [] -> null
        # (5 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg must be replaced
-/+ resource "azurerm_resource_group" "rg" {
      ~ id       = "/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007" -> (known after apply)
      ~ name     = "TFCloudRG007" -> "TFCloudRG" # forces replacement
      - tags     = {} -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_subnet.subnet must be replaced
-/+ resource "azurerm_subnet" "subnet" {
      ~ address_prefix                                 = "10.0.1.0/24" -> (known after apply)
      ~ id                                             = "/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/virtualNetworks/Vnet-tf/subnets/Subnet01" -> (known after apply)
      ~ name                                           = "Subnet01" -> "subnet01" # forces replacement
      ~ resource_group_name                            = "TFCloudRG007" -> "TFCloudRG" # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "Vnet-tf" -> "vnet-tf" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # azurerm_virtual_network.vnet must be replaced
-/+ resource "azurerm_virtual_network" "vnet" {
      - dns_servers           = [] -> null
      ~ guid                  = "a28da813-c691-4120-8c36-83969ffb2c0d" -> (known after apply)
      ~ id                    = "/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/virtualNetworks/Vnet-tf" -> (known after apply)
      ~ name                  = "Vnet-tf" -> "vnet-tf" # forces replacement
      ~ resource_group_name   = "TFCloudRG007" -> "TFCloudRG" # forces replacement
      ~ subnet                = [
          - {
              - address_prefix = "10.0.1.0/24"
              - id             = "/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG007/providers/Microsoft.Network/virtualNetworks/Vnet-tf/subnets/Subnet01"
              - name           = "Subnet01"
              - security_group = ""
            },
        ] -> (known after apply)
        tags                  = {
            "environment" = "Terraform Cloud Demo"
        }
        # (3 unchanged attributes hidden)
    }

  # random_id.randomId must be replaced
-/+ resource "random_id" "randomId" {
      ~ b64_std     = "Vg5CMoDBZRE=" -> (known after apply)
      ~ b64_url     = "Vg5CMoDBZRE" -> (known after apply)
      ~ dec         = "6200966521611707665" -> (known after apply)
      ~ hex         = "560e423280c16511" -> (known after apply)
      ~ id          = "Vg5CMoDBZRE" -> (known after apply)
      ~ keepers     = { # forces replacement
          ~ "resource_group" = "TFCloudRG007" -> "TFCloudRG"
        }
        # (1 unchanged attribute hidden)
    }

Plan: 9 to add, 0 to change, 9 to destroy.
```
</details>
*Pusher: @lokpavan03, Action: `pull_request`*